#### Terraform Format and Style `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
aws_cloudwatch_log_group.ecs_logs: Refreshing state... [id=/ecs/usac-demo-task]
aws_security_group.alb_sg: Refreshing state... [id=sg-091288c8df2aa4e3f]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs_task_execution_role_usac_demo]
aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:737584674007:targetgroup/usac-demo-tg/faf1bf1a5129ee47]
aws_security_group.ecs_service_sg: Refreshing state... [id=sg-0dd04b5f6c1bdc7ab]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:737584674007:loadbalancer/app/usac-demo-alb/cb9415ec8df14052]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=ecs_task_execution_role_usac_demo/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_ecs_task_definition.main: Refreshing state... [id=usac-demo-task]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:737584674007:listener/app/usac-demo-alb/cb9415ec8df14052/e7f1f8081bed63c0]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-1:737584674007:service/USAC-2025/usac-demo-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:737584674007:service/USAC-2025/usac-demo-service"
        name                               = "usac-demo-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:737584674007:task-definition/usac-demo-task:5" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:737584674007:task-definition/usac-demo-task:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:737584674007:task-definition/usac-demo-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "737584674007.dkr.ecr.us-east-1.amazonaws.com/usac-2025:ebec055ef10b4ddf35a0773190c1cfa1288fbd84" -> "737584674007.dkr.ecr.us-east-1.amazonaws.com/usac-2025:latest"
                  - mountPoints      = []
                    name             = "flask-color-app-container"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "usac-demo-task" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AbelGuti, Action: `pull_request`*